
## Plan Result

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6322762056)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_api_gateway_deployment.deployment
  * aws_api_gateway_integration.integration
  * aws_lambda_function.migrate_function
  * aws_lambda_permission.apigw


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "rh57akzs83"
      + stage_name    = "prod"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "qgpg3b"
      + rest_api_id             = "rh57akzs83"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_lambda_function.migrate_function will be created
  + resource "aws_lambda_function" "migrate_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_binary.zip"
      + function_name                  = "recruit-service-board-migrate"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::113713103169:role/recruit-service-board-lambda-execution"
      + runtime                        = "go1.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + vpc_config {
          + security_group_ids = [
              + "sg-046b937d63c1b724e",
            ]
          + subnet_ids         = [
              + "subnet-04400242864195eba",
              + "subnet-0e7f8c94361b73d2f",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "recruit-service-board-migrate"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":26,"Program":"tfcmt","SHA1":"0b328b3489f23fd2c5de8966f45fdf123c49296c","Vars":{},"WorkflowName":"Terraform"} -->